[
    {
        "title" : "Steel Defect Detection",
        "icon" : "Assets/Projects/steel.png",
        "subtitle" : "Computer Vision Project @ Xen.AI",
        "data_target" : "#steel",
        "full_pic" : "Assets/Projects/steel-full.png",
        "details": 
        [
            "For a steel manufacturing industry client, I had successfully built an ML system capable of performing steel defect anomaly detection from images collected in various stages of the production line.",
            "This helped benefit the clients as it would reduce the number of workers needed to check for defects as well as increase the production throughput by letting the ML model handle the quality check stage.",
            "By using a Xception model and keeping a threshold of 0.2 inorder to decrease the number of False Positives - the model reached an accuracy of 92%."
        ],
        "tech" : ["Python","Deep Learning","Pandas","Sklearn","Xception"]
    },
    {
        "title" : "Truck Anomaly Detecion",
        "icon" : "Assets/Projects/truck.png",
        "subtitle" : "Anomaly Detection Project @ Xen.AI",
        "data_target" : "#truck",
        "full_pic" : "Assets/Projects/truck-full.png",
        "details": 
        [
            "For a truck company client, I helped to build an anomaly detection system using telmatics data collected from various trucks over time.",
            "Using the ensemble model Isolation Forest to build an anomaly detection system."
        ],
        "tech" : ["Python","Sklearn","PyOD","Isolation Forest"]
    },
    {
        "title" : "Admissions Query Bot",
        "icon" : "Assets/Projects/chatbot.png",
        "subtitle" : "Azure ML Project @ Aveon Infotech",
        "data_target" : "#chatbot",
        "full_pic" : "Assets/Projects/chatbot-full.png",
        "details": 
        [
            "Using Azure Cloud Machine Learning services to integrate AI into a chatbot depending on customer requirements.",
            "Built an Admission Queries Bot for college admission process which uses Azure ML natural language processing services such as LUIS (Language Understanding), speech-to-text,text-to-speech, sentiment analysis, etc."
        ],
        "tech" : ["Python","Azure Cloud","LUIS"]
    },
    {
        "title" : "Form Recognizer",
        "icon" : "Assets/Projects/form.png",
        "subtitle" : "Azure OCR Project @ Aveon Infotech",
        "data_target" : "#forms",
        "full_pic" : "Assets/Projects/form-full.png",
        "details": 
        [
            "Using Azure Cloud Machine Learning services to integrate AI service to automatically read forms and extract the necessary details.",
            "Built an Auto Form Scrapping bot for college admission process which uses Azure ML OCR technologies, image Recoginzation technologies to understand the form and extract the necessary details with atmost accuracy.",
            "It is also capable of identifying the key-value pairs and automatically store them into the database system"
        ],
        "tech" : ["Python","Azure Cloud","OCR","Computer Vision"]
    },
    {
        "title" : "Campus Management System Dashboards",
        "icon" : "Assets/Projects/cms.png",
        "subtitle" : "Product Development @ Aveon Infotech",
        "data_target" : "#cmsdashboard",
        "full_pic" : "Assets/Projects/cms-full.png",
        "details": 
        [
            "Aveon Infotech is one of the leading Campus Management System software company in Coimbatore.",
            "The idea behind the project was to help implement dashboards into the existing CMS systems.",
            "As a data scientist, I had to use the school/univiersity data of various domains such as admission, class management, staff management, financing, accredations, inventory managemenent, library management, hostel management, etc.. to build useful dashboards that helps convey the information in a more neat and organized manner to the customer."
        ],
        "tech" : ["Python","SQL","SQL Management Studio","PowerBI"]
    },
    {
        "title" : "Sentiment Analysis Research Study",
        "icon" : "Assets/Projects/Sentiment-Analysis.png",
        "subtitle" : "Research Project @ IIT Kanpur",
        "data_target" : "#sentiment",
        "full_pic" : "Assets/Projects/Sentiment-Analysis-full.png",
        "details": 
        [
            "A research based collaboration project during my Internship at IIT Kanpur.",
            "The goal of the research was to build and compare the different machine learning models capable of analyzing and identifying the sentiments in the given twitter data.",
            "Raw twitter data had to undergo many stages of data cleaning, to make it more friendly for the ML model to understand.",
            "A comparative study of the different models and varying methods of NLP such as Bag of Words, Tf-Idf vectorizer and Word2Vec, along with a wide variety of ML models.",
            "The results have been neatly noted and presented in the form of a report."
        ],
        "tech" : ["Python","Pandas","NLTK","SpaCy","Gensim","Sklearn"]
    }   
]

