[
    {
        "date": "09/2022 - 06/2023",
        "title": "Data Scientist",
        "company": "Aveon Infotech",
        "details": [
            "Presented complex data findings to non-technical stakeholders clearly and concisely using Power BI Dashboards and SQL queries, enabling informed business decisions and driving a 10% increase in revenue.",
            "Designed an in-house AI resume parser bot for the HR team, resulting in a 70% success rate in identifying suitable candidates and speeding the hiring process by 2 weeks.",
            "Led an 8-member team for a new e-commerce client project, successfully overseeing the warehouse management system and reducing downtime by 50% through efficient log management.",
            "Orchestrated client communication and project coordination for a critical project, assuring on-time delivery of milestones and high client satisfaction.",
            "Designed and implemented an automation-based reporting infrastructure using Excel, resulting in a remarkable 90% reduction in the preparation time for standard client materials for daily/weekly meetings."
        ]
    },
    {
        "date": "08/2021 - 03/2022",
        "title": "Machine Learning Engineer Intern",
        "company": "Xen.AI",
        "details":[
            "Engineered deep learning architectures using TensorFlow for computer vision task of steel defect detection, achieving 92% accuracy and minimizing the possibility of misclassification of defective products to just 0.04%.",
            "Utilized Matplotlib and Pyplot to create insightful data visualizations and deliver compelling client presentations for PoC projects, contributing to the acquisition of 2 new clients.",
            "Assisted with implementing PyOD on telematics truck data for an anomaly detection project, resulting in 25% faster project delivery and improved anomaly identification."
        ]
    },
    {
        "date": "04/2020 - 06/2020",
        "title": "Machine learning and Data Science Trainee",
        "company": "IIT Kanpur",
        "details":[
            "Worked under an IIT professor on a research project analyzing Twitter data, using advanced data mining techniques and natural language processing to determine user behavior and sentiment analysis.",
            "Leveraged NLTK and SpaCy for data cleaning. After performing feature engineering to extract derived features such as emojis, emoticons, positive/negative words, and so on, performance improved by 5%.",
            "Conducted a comparative analysis of machine learning models and vectorization methods, including Bag-of-Words(BOW), TF-IDF, and word embedding, providing insights into their task effectiveness."
        ]
    }
]